# SetVPClOvrdRoofTxt

```pascal
PROCEDURE SetVPClOvrdRoofTxt(
				viewportHandle : HANDLE;
				className      : STRING;
				topMaterial    : LONGINT;
				dormerMaterial : LONGINT);
```

```python
def vs.SetVPClOvrdRoofTxt(viewportHandle, className, topMaterial, dormerMaterial):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle|
|className|STRING|The name of the class override|
|topMaterial|LONGINT|The material of the top|
|dormerMaterial|LONGINT|The material of the dormer|

## Version
Availability: from Vectorworks 2018

## Category
* Viewports